from HostServer.BaseServer import BaseServer
from MainObject.Config.HSConfig import HSConfig
from MainObject.Config.VMPowers import VMPowers
from MainObject.Public.HWStatus import HWStatus
from MainObject.Public.ZMessage import ZMessage
from MainObject.Config.VMConfig import VMConfig


class HostServer(BaseServer):
    # 宿主机服务 ###############################################################
    def __init__(self, config: HSConfig, **kwargs):
        super().__init__(config, **kwargs)
        super().__load__(**kwargs)
        # 添加变量 =============================================================
        # TODO: 增加此主机需要使用的变量

    # 宿主机任务 ###############################################################
    def Crontabs(self) -> bool:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().Crontabs()

    # 宿主机状态 ###############################################################
    def HSStatus(self) -> HWStatus:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().HSStatus()

    # 初始宿主机 ###############################################################
    def HSCreate(self) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().HSCreate()

    # 还原宿主机 ###############################################################
    def HSDelete(self) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().HSDelete()

    # 读取宿主机 ###############################################################
    def HSLoader(self) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().HSLoader()

    # 卸载宿主机 ###############################################################
    def HSUnload(self) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().HSUnload()

    # 虚拟机列出 ###############################################################
    # :params vm_name: 虚拟机UUID
    # ##########################################################################
    def VMStatus(self, vm_name: str = "") -> dict[str, list[HWStatus]]:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VMStatus(vm_name)

    # 创建虚拟机 ###############################################################
    # :params vm_conf: 虚拟机配置
    # ##########################################################################
    def VMCreate(self, vm_conf: VMConfig) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VMCreate(vm_conf)

    # 安装虚拟机 ###############################################################
    # :params os_name: 操作系统名称
    # :params vm_file: 虚拟机文件
    # :params os_size: 操作系统大小
    # ##########################################################################
    def VInstall(self, vm_conf: VMConfig) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VInstall(vm_conf)

    # 配置虚拟机 ###############################################################
    # :params vm_conf: 新的虚拟机配置
    # :params vm_last: 老的虚拟机配置
    # ##########################################################################
    def VMUpdate(self, vm_conf: VMConfig, vm_last: VMConfig) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VMUpdate(vm_conf, vm_last)

    # 删除虚拟机 ###############################################################
    # :params vm_name: 虚拟机UUID
    # ##########################################################################
    def VMDelete(self, vm_name: str) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VMDelete(vm_name)

    # 虚拟机电源 ###############################################################
    # :params vm_name: 虚拟机UUID
    # :params power: 虚拟机电源
    # ##########################################################################
    def VMPowers(self, vm_name: str, power: VMPowers) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().VMPowers(vm_name, power)

    # 设置虚拟机密码 ###########################################################
    # :params vm_name: 虚拟机UUID
    # :params os_pass: 虚拟机密码
    # ##########################################################################
    def Password(self, vm_name: str, os_pass: str) -> ZMessage:
        # 专用操作 =============================================================
        # TODO: 增加此主机需要执行的任务
        # 通用操作 =============================================================
        return super().Password(vm_name, os_pass)
